
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Запись.АдресЭлектроннойПочты, Истина);
	ПараметрыЗаписи.Вставить("Замещение", Истина);
	
	Если НЕ СоответствуетТребованиям Тогда
		Отказ = Истина;
		Сообщение = НСтр("ru = 'Почтовый адрес заполнен неверно.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти