
Функция ЭтоАсинхронныйСканерШтрихкодов(ОборудованиеСканирования) Экспорт
	
	Если ЗначениеЗаполнено(ОборудованиеСканирования)
		И ОборудованиеСканирования.ДрайверОборудования = Справочники.ДрайверыОборудования.Драйвер1ССканерШтрихкода Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СканерШтрихкодовИнициализирован() Экспорт
	
	Возврат ПараметрыСеанса.СканерШтрихкодовИнициализирован;
	
КонецФункции

Процедура УстановитьСканерШтрихкодовИнициализирован(Инициализирован) Экспорт
	
	ПараметрыСеанса.СканерШтрихкодовИнициализирован = Инициализирован;
	
КонецПроцедуры