
#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыМастераРегистрации() Экспорт
	
	ПараметрыМастера = Новый Структура;
	ПараметрыМастера.Вставить("ОтображатьПредупреждениеПередЗакрытиемБезРегистации", Ложь);
	ПараметрыМастера.Вставить("ТекстПредупреждениеПередЗакрытиемБезРегистации", "");
	
	Возврат ПараметрыМастера;
	
КонецФункции

Функция ПолучитьПараметрыПодтвержденияЗагрузкиФайла() Экспорт
	
	ПараметрыМастера = Новый Структура;
	ПараметрыМастера.Вставить("ЗаданиеURL", "");
	ПараметрыМастера.Вставить("ОписаниеОповещения");
	
	Возврат ПараметрыМастера;
	
КонецФункции

Функция ПолучитьИмяБазы() Экспорт
	
	Возврат СинхронизацияКлиентСервер.ПолучитьИмяБазы();
	
КонецФункции

#КонецОбласти
