
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	АдресEmail               = Параметры.АдресEmail;
	НомерТелефона            = Параметры.НомерТелефона;
	
	Если НЕ Параметры.АдресEmailСвязанныхДокументов.Количество() = 0 Тогда
		АдресEmailЧекаПродажи    = Параметры.АдресEmailСвязанныхДокументов[0];
		
		Элементы.АдресEmailОснования.Заголовок = АдресEmailЧекаПродажи;
		
	КонецЕсли;
	
	Если НЕ Параметры.НомерТелефонаСвязанныхДокументов.Количество() = 0 Тогда
		
		НомерТелефонаСвязанногоДокумента = Параметры.НомерТелефонаСвязанныхДокументов[0];
		
		ШаблонНомера = "+7 (%1%%2%%3%) %4%%5%%6% - %7%%8% - %9%%10%";
		
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%1%",  Сред(НомерТелефонаСвязанногоДокумента,  1, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%2%",  Сред(НомерТелефонаСвязанногоДокумента,  2, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%3%",  Сред(НомерТелефонаСвязанногоДокумента,  3, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%4%",  Сред(НомерТелефонаСвязанногоДокумента,  4, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%5%",  Сред(НомерТелефонаСвязанногоДокумента,  5, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%6%",  Сред(НомерТелефонаСвязанногоДокумента,  6, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%7%",  Сред(НомерТелефонаСвязанногоДокумента,  7, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%8%",  Сред(НомерТелефонаСвязанногоДокумента,  8, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%9%",  Сред(НомерТелефонаСвязанногоДокумента,  9, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%10%", Сред(НомерТелефонаСвязанногоДокумента, 10, 1));
		
		НомерТелефонаЧекаПродажи = ШаблонНомера;
		
		Элементы.НомерТелефонаОснования.Заголовок = НомерТелефонаЧекаПродажи;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьОформлениеПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	
	НомерТелефонаФормат = СтрЗаменить(НомерТелефона, "+", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, "(", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, ")", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, "-", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, " ", "");
	
	Если СтрДлина(НомерТелефонаФормат) = 11 И Лев(НомерТелефонаФормат, 1) = "7" Тогда
		НомерТелефонаФормат = Сред(НомерТелефонаФормат, 2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефонаФормат) Тогда
		
		Если НЕ ОбщегоНазначенияКлиентСервер.ДанныеНомераТелефонаКорректны(НомерТелефонаФормат) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Номер телефона заполнен неверно'"));
			
			ЕстьОшибки = Истина;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресEmail) Тогда
		
		СоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(
			АдресEmail, Истина
		);
		
		Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресEmail, Истина) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Адрес e-mail заполнен неверно'"));
			
			ЕстьОшибки = Истина;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("АдресEmail", АдресEmail);
	ПараметрыЗакрытия.Вставить("НомерТелефона", НомерТелефонаФормат);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаОснования(Команда)
	
	НомерТелефона = НомерТелефонаЧекаПродажи;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресEmailОснования(Команда)
	АдресEmail = АдресEmailЧекаПродажи;
КонецПроцедуры

&НаКлиенте
Процедура MailRu(Команда)
	
	ДобавитьКАдресуEMAIL("@mail.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура RamblerRu(Команда)
	
	ДобавитьКАдресуEMAIL("@rambler.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура YahooCom(Команда)
	
	ДобавитьКАдресуEMAIL("@yahoo.com");
	
КонецПроцедуры

&НаКлиенте
Процедура YandexRu(Команда)
	
	ДобавитьКАдресуEMAIL("@yandex.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура YaRu(Команда)
	
	ДобавитьКАдресуEMAIL("@ya.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура GmailCom(Команда)
	
	ДобавитьКАдресуEMAIL("@gmail.com");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьКАдресуEMAIL(ПостфиксАдреса)
	
	// удалить текущий постфикс
	ПозицияСимвола = СтрНайти(АдресEmail, "@");
	
	Если ПозицияСимвола > 0 Тогда
		АдресEmail = Лев(АдресEmail, ПозицияСимвола - 1);
	КонецЕсли;
	
	АдресEmail = АдресEmail + ПостфиксАдреса;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОформлениеПолей()
	
	Элементы.НомерТелефонаОснования.Видимость = ЗначениеЗаполнено(НомерТелефонаЧекаПродажи);
	Элементы.АдресEmailОснования.Видимость = ЗначениеЗаполнено(АдресEmailЧекаПродажи);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначения.НастроитьКомандуГотово(ЭтотОбъект, "ГруппаГотово", "Готово", 2);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

