
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	Заголовок = Параметры.ЗаголовокФормы;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.РеквизитыОрганизации);
	
	КодСтраны      = ?(КодСтраны = "0", "", КодСтраны);
	КодРегиона     = ?(КодРегиона = "0", "", КодРегиона);
	ПочтовыйИндекс = ?(ПочтовыйИндекс = "0", "", ПочтовыйИндекс);
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	СписокПолей = "Код,
	|Наименование,
	|НаименованиеПолное,
	|КПП,
	|ИНН,
	|КодСтраны,
	|КодРегиона,
	|ПочтовыйИндекс,
	|ПредставлениеАдреса";
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокПолей, "ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокПолей, "ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

