#Область ПрограммныйИнтерфейс

// Возвращает список доступных типов оборудования.
// 
// Возвращаемое значение:
//   Массив - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	// Устройство ввода
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода);
	// Конец Устройство ввода.
	
	// ККТ с передачей данных
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	// Конец ККТ с передачей данных.
	
	// Фискальные регистраторы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
	// Конец Фискальные регистраторы.
	
	// Принтер чеков
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	// Конец принтер чеков.
	
	// Платежные cистемы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема);
	// Конец Платежные cистемы.
	
	Возврат СписокОборудования;
	
КонецФункции

// Обновить поставляемые драйверы в составе конфигурации
//                                   
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	// Мультиплатформенные драйвера
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ9X",
		"АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.ATOL_KKT_1C83_V9",
		Ложь,
		"9.12.4.6377");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ10X",   
		"АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x",
		"AddIn.ATOL_KKT_1C83_V10", 
		Ложь,
		"10.4.4.0");
	// Конец ККТ с передачей данных.
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"Драйвер1СПринтерЧеков", 
		"1С:Принтер чеков",
		"AddIn.ReceiptPrinterNative", 
		Ложь,
		"3.0.2.0");
	// Конец Принтеры чеков
	
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1ССканерШтрихкода",
		"1С:Cканер штрихкода (Native)",
		"AddIn.InputDevice",
		Ложь,
		"9.0.4.5");
	
#Если МобильноеПриложениеСервер Тогда
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверВерсияТККТ54ФЗ",
		"Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.VT_KKT_1CInt",
		Ложь,
		"1.0.3");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверШтрихМККТ54ФЗ",
		"Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.com_shtrih_jpos1c",
		Ложь,
		"1.16.1");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАЗУРККТ54ФЗ",
		"АЗУР:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.com_azurpos_fz54_AzurPos",
		Ложь,
		"1.0.5.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверRightScanККТ54ФЗ",
		"RightScan:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.FNCore",
		Ложь,
		"1.23");
	// Конец ККТ с передачей данных.
	
	// Фискальные регистраторы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор,
		"Драйвер1СДрайверFPrint11", 
		"1С:Драйвер FPrint-11",
		"com.e1c.driverforatolkkm", 
		Истина,
		"2.0.7.2");
	// Конец Фискальные регистраторы
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"ДрайверRightScanУстройствоПечати", 
		"RightScan:Устройство печати ТСД Urovo",
		"AddIn.RSPrinter",
		Ложь,
		"1.15");
	// Конец принтеров чеков
	
	// Устройство ввода
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1СУстройствоВвода", 
		"1С:Устройство ввода",
		"com.e1c.inputdevice",
		Истина,
		"1.0.1.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканкодСканерШтрихкода", 
		"СКАНКОД:Cканер штрихкода Chipherlab (Native)",
		"AddIn.ScancodeBarcodeScannerCPT",
		Ложь,
		"1.0.0.23");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверRightScanУстройстваВвода", 
		"RightScan:Устройства ввода данных ТСД Urovo",
		"AddIn.RSDriver",
		Ложь,
		"1.20");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверScanPortУстройстваВвода",
		"ScanPort:Устройства ввода данных",
		"AddIn.ScanportScanner",
		Ложь,
		"2.0.0.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканситиУстройстваВвода",
		"СКАН СИТИ:Устройства ввода данных",
		"AddIn.ScanCityNewlandBarcode",
		Ложь,
		"1.0.1.3");
	// Конец устройство ввода

	// Платежные cистемы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверInpasПлатежнаяСистема", 
		"ИНПАС:Эквайринг-терминал",
		"com.inpas.dualconnector1c",
		Истина,
		"1.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверIboxProПлатежнаяСистема", 
		"2Can:Сервис приема платежей",
		"iboxPro1C",
		Истина,
		"1.0.1.9");        
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверАЗУРПлатежнаяСистема", 
		"АЗУР:Платежная система",
		"AddIn.com_azurpos_payment_AzurPosPayment",
		Ложь,
		"1.0.2.1");        
	// Конец Платежные cистемы.
	
#КонецЕсли
	
КонецПроцедуры

// Обновление библиотеки в составе конфигурации.
//                                   
Процедура ОбновлениеБиблиотеки() Экспорт
	
	ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

// Возвращает флаг возможности добавления новых драйверов в справочник драйверов
//
Функция ВозможностьДобавленияНовыхДрайверов() Экспорт
	
	МожноДобавлятьНовыеДрайвера = Истина;
	Возврат МожноДобавлятьНовыеДрайвера;
	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным из текущего сеанса.
//  
// Возвращаемое значение:
//  Булево - В случае вызова в неразделенной конфигурации возвращает Истина.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область РаботаСЭлементомФормы

// Дополнительные переопределяемые действия с элементом формы 
// служит для учета специфики визуального отображения в зависимости от типа клиента.
//
Процедура ПодготовитьЭлементУправления(ЭлементУправления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
Процедура ЭкземплярОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ЭкземплярОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт

КонецПроцедуры

#КонецОбласти