
#Область ПрограммныйИнтерфейс

Процедура УстановитьПутьКФайлуЛога() Экспорт
	
	Каталог = КаталогДокументов();
	
	ИмяФайла = Каталог + ИмяФайлаЛога();
	
	ОбщегоНазначенияВызовСервера.УстановитьПараметрСеанса("ПутьКФайлуЛога", ИмяФайла);
	
КонецПроцедуры

Функция ИмяФайлаЛога() Экспорт
	
	Возврат "mobile_cashbox_log.txt";
	
КонецФункции

Процедура УдалитьФайлЛога() Экспорт
	
	Файл = Новый Файл(ЗначениеНастроекВызовСервераПовтИсп.ПутьКФайлуЛога());
	
	Если Файл.Существует() Тогда
		
		Оповещение = Новый ОписаниеОповещения("УдалитьФайлЛогаЗавершение",
			ЭтотОбъект);
			
		НачатьУдалениеФайлов(Оповещение, ЗначениеНастроекВызовСервераПовтИсп.ПутьКФайлуЛога());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьФайлЛогаЗавершение(Результат) Экспорт
	
	ПомощникUIКлиент.ПоказатьСообщение(НСтр("ru = 'Журнал приложения очищен'"));
	
КонецПроцедуры

#КонецОбласти
