
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	Элементы.СкачатьОписаниеПриложения.Заголовок = Элементы.СкачатьОписаниеПриложения.Заголовок + " " + НСтр("ru = '(~6 Мб, PDF)'");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьEmailРазработчикам(Команда)
	
	ПараметрыПисьма = РаботаСПочтойВызовСервера.СформироватьОбращениеВПоддержку();
	ЗапуститьПриложение(ПараметрыПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОставитьОтзывНаGooglePlay(Команда)
	
	ЗапуститьПриложение("https://play.google.com/store/apps/details?id=com.e1c.mobilecashboxdemo&hl=ru");
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьОписаниеПриложения(Команда)
	
	ЗапуститьПриложение("http://v8.1c.ru/retail/kassa-mobile/cash-mobile-doc.pdf");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПроекта(Команда)
	
	ЗапуститьПриложение("http://v8.1c.ru/retail/kassa-mobile/m/");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриобретениеИРаспространение(Команда)
	
	ЗапуститьПриложение("http://1c.ru/news/info.jsp?id=19740");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

