
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает (обновляет) элемент справочника, соответствующий виду объекта ЕГАИС.
//
// Параметры:
//  Имя                     - Строка - имя объекта ЕГАИС,
//  ПространствоИмен        - Строка - пространство имен объекта ЕГАИС,
//  ПрефиксПространстваИмен - Строка - префикс пространства имен объекта ЕГАИС,
//  ПутьНаСервере           - Строка - путь в ТМ ЕГАИС к объекту,
//  Родитель                - Строка - имя родителя объекта ЕГАИС.
//
Процедура ЗаполнитьПредопределенныйЭлемент(Имя, ПространствоИмен, ПрефиксПространстваИмен, ПутьНаСервере) Экспорт
	
	Попытка
		ВидОбъекта = ОбщегоНазначенияВызовСервера.ПредопределенныйЭлемент("Справочник.ВидыОбъектовЕГАИС." + Имя);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ВидыОбъектовЕГАИС." + Имя);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если ВидОбъекта = Неопределено Тогда
		ВидОбъекта = Справочники.ВидыОбъектовЕГАИС.СоздатьЭлемент();
		ВидОбъекта.ИмяПредопределенныхДанных = Имя;
	Иначе
		ВидОбъекта = ВидОбъекта.ПолучитьОбъект();
	КонецЕсли;
	
	ВидОбъекта.Наименование = ИнтеграцияЕГАИСКлиентСервер.Синоним(Имя);
	ВидОбъекта.ПространствоИмен = ПространствоИмен;
	ВидОбъекта.ПрефиксПространстваИмен = ПрефиксПространстваИмен;
	ВидОбъекта.ПутьНаСервере = ПутьНаСервере;
	ВидОбъекта.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли