
Функция ПолучитьСтатусЗаказаПоНаименованию(НаименованиеСтатуса) Экспорт
	
	Если НаименованиеСтатуса = "НеСогласован" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		
	ИначеЕсли НаименованиеСтатуса = "Согласован" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Согласован;
		
	ИначеЕсли НаименованиеСтатуса = "Выполнен" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Выполнен;
		
	ИначеЕсли НаименованиеСтатуса = "Отменен" Тогда
		
		Возврат Перечисления.СтатусыЗаказовКлиентов.Отменен;
		
	КонецЕсли;
	
КонецФункции