
Функция ВидОперацииЧека_Продажа() Экспорт
	
	ВидОперации = 0;
	
	Возврат ВидОперации;
	
КонецФункции

Функция ВидОперацииЧека_Возврат() Экспорт
	
	ВидОперации = 1;
	
	Возврат ВидОперации;
	
КонецФункции

// Тип чека: 1-Продажа, 2-Возврат продажи, 3-Покупка, 4-Возврат покупки.

Функция ТипЧека_Продажа() Экспорт
	
	ТипЧека = 1;
	
	Возврат ТипЧека;
	
КонецФункции

Функция ТипЧека_ВозвратПродажи() Экспорт
	
	ТипЧека = 2;
	
	Возврат ТипЧека;
	
КонецФункции

Функция ТипЧека_Покупка() Экспорт
	
	ТипЧека = 3;
	
	Возврат ТипЧека;
	
КонецФункции

Функция ТипЧека_ВозвратПокупки() Экспорт
	
	ТипЧека = 4;
	
	Возврат ТипЧека;
	
КонецФункции

Функция ПрефиксШтрихкодаЧека() Экспорт
	
	Возврат "99"; //диапазон купонов
	
КонецФункции

// маркировка

Функция ТипМарки_Алкоголь() Экспорт
	
	Возврат "Алкоголь";
	
КонецФункции

Функция ТипМарки_Мех() Экспорт
	
	Возврат "Мех";
	
КонецФункции

Функция ТипМарки_Табак() Экспорт
	
	Возврат "Табак";
	
КонецФункции

Функция ТипМарки_Обувь() Экспорт
	
	Возврат "Обувь";
	
КонецФункции

Функция ТипКоррекции_Самостоятельно() Экспорт
	
	Возврат 0;
	
КонецФункции

Функция ТипКоррекции_ПоПредписанию() Экспорт
	
	Возврат 1;
	
КонецФункции

