#Область ПрограммныйИнтерфейс

// Возвращает признак автоматического преобразования ШтрихкодаBase64 в Штрихкод.
//  
Функция ПреобразованиеШтрихкодаBase64()  Экспорт
	
	Возврат Истина;
	
КонецФункции

// Переопределяемя процедура вызывается после открытия чека.
//
Процедура ПечатьЧекаПослеОткрытияЧека(ПараметрыВыполнения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.НомерСмены) Тогда
		ПараметрыВыполнения.ПараметрыЧекаЕГАИС.НомерСменыККМ = ПараметрыВыполнения.НомерСмены;
	Иначе
		ПараметрыВыполнения.ПараметрыЧекаЕГАИС.НомерСменыККМ = ПродажиВызовСервера.ПолучитьНомерСмены();
		ПараметрыВыполнения.НомерСмены = ПараметрыВыполнения.ПараметрыЧекаЕГАИС.НомерСменыККМ;
	КонецЕсли;
	
	ПараметрыВыполнения.ПараметрыЧекаЕГАИС.НомерЧекаККМ = ПараметрыВыполнения.НомерЧека;
	
	РезультатОперации = ИнтеграцияЕГАИСКлиентСервер.ПолучитьЭлектроннуюПодписьЧекаВУТМ(
		ПараметрыВыполнения.ПараметрыЧекаЕГАИС,
		ПараметрыВыполнения.ПараметрыЧекаЕГАИС.ТаблицаТоваров);
	
	Если РезультатОперации.Результат Тогда
		
		ПараметрыВыполнения.ПродолжитьПечать = Истина;
		
		ПараметрыВыполнения.АдресЧека   = РезультатОперации.Адрес;
		ПараметрыВыполнения.ПодписьЧека = РезультатОперации.Подпись;
		
	Иначе
		
		ПараметрыВыполнения.ПродолжитьПечать = Ложь;
		ПараметрыВыполнения.ТекстОшибки = РезультатОперации.ОписаниеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемя процедура вызывается при ошибке печати чека.
//
Функция ПечатьЧекаПриОшибкеПечати(ПараметрыВыполнения) Экспорт
	
	ТекстОшибки = "";
	ИнтеграцияЕГАИСКлиент.ОтменитьЧекВУТМ(ПараметрыВыполнения.ПараметрыЧекаЕГАИС, ПараметрыВыполнения.ПараметрыЧекаЕГАИС.ТаблицаТоваров, ТекстОшибки);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
КонецПроцедуры

// Переопределяемая функция возвращает разрешение использовать несколько экземпляров одного типа оборудования.
//
Функция РазрешитьНесколькоЭкземпляровОдногоТипаОборудования() Экспорт
	
	Результат = Истина;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
