
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	УстановленныйПериод = Параметры.Период;
	
	Период.ДатаНачала    = УстановленныйПериод.ДатаНачала;
	Период.ДатаОкончания = УстановленныйПериод.ДатаОкончания;
	Период.Вариант       = УстановленныйПериод.Вариант;
	
	Если Параметры.Свойство("СкрытьОтменить") Тогда
		Элементы.Сбросить.Видимость = Ложь;
	КонецЕсли;
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сегодня(Команда)
	
	Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	Закрыть(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура Завтра(Команда)
	
	Период.Вариант = ВариантСтандартногоПериода.Завтра;
	Закрыть(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура Вчера(Команда)
	
	Период.Вариант = ВариантСтандартногоПериода.Вчера;
	Закрыть(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПериод(Команда)
	
	Закрыть("ОчиститьПериод");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);
	
	ОбщегоНазначения.НастроитьКомандуГотово(ЭтотОбъект, , , 2);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана 

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

