
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьУстройствоПечати(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеУстройствоПечати",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСканерШтрихкодов(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПлатежнуюСистему(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеПлатежнаяСистема",,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования()) Тогда
		Элементы.НастроитьСканерШтрихкодов.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Элементы.НастроитьСканерШтрихкодов.Отображение = ОтображениеКнопки.Авто;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати()) Тогда
		Элементы.НастроитьУстройствоПечати.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Элементы.НастроитьУстройствоПечати.Отображение = ОтображениеКнопки.Авто;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПлатежнойСистемы()) Тогда
		Элементы.НастроитьПлатежнуюСистему.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Элементы.НастроитьПлатежнуюСистему.Отображение = ОтображениеКнопки.Авто;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
