
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// УниверсальныеМеханизмы
	Если ИменаПараметровСеанса = Неопределено Тогда
		
		ИменаПараметровСеанса = Новый Массив;
		ИменаПараметровСеанса.Добавить("АдминистративныйРежим");
		ИменаПараметровСеанса.Добавить("ИмяПровайдераГеолокации");
		ИменаПараметровСеанса.Добавить("ТекущийПользователь");
		ИменаПараметровСеанса.Добавить("РабочееМестоКлиента");
		
	КонецЕсли;
	
	// Установка параметров сеанса "по требованию".
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры.
	УстановленныеПараметры = Новый Массив();
	Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
		УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
	КонецЦикла;
	
	
	// Конец УниверсальныеМеханизмы
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	
	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование
	
	Если ИмяПараметра = "АдминистративныйРежим" Тогда
		ПараметрыСеанса.АдминистративныйРежим = Ложь;
	КонецЕсли;
		
	Если ИмяПараметра = "ИмяПровайдераГеолокации" Тогда
		ПараметрыСеанса.ИмяПровайдераГеолокации = "";
	КонецЕсли;
	
	Если ИмяПараметра = "ТекущийПользователь" Тогда
		ПараметрыСеанса.ТекущийПользователь = ОбщегоНазначения.ОпределитьТекущегоПользователя();
	КонецЕсли;
	
	Если ИмяПараметра = "ПутьКФайлуЛога" Тогда
		ПараметрыСеанса.ПутьКФайлуЛога = "";
	КонецЕсли;
	
	// Конец переопределяемого блока.
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
