
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование()
	
	Если НЕ ПустаяСтрока(Имя) И ПустаяСтрока(Отчество) Тогда
		
		Наименование = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2.", Фамилия, Лев(Имя, 1));
		
	ИначеЕсли НЕ ПустаяСтрока(Имя) И НЕ ПустаяСтрока(Отчество) Тогда
		
		Наименование = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2.%3.", Фамилия, Лев(Имя, 1), Лев(Отчество, 1));
		
	Иначе
		
		Наименование = Фамилия;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
