
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	ЗаполнитьОписание();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		ЗаполнитьОписание();
		
	ИначеЕсли ИмяСобытия = "ЗакрытьМастер" Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьМастер(Команда)
	
	РегистрацияВОблакеКлиент.ЗакрытьМастер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОписание()
	
	Содержимое1 = НСтр("ru = 'Начните работать с 1С:Кассой и посмотрите, насколько легче и быстрее можно решать ежедневные задачи
	|
	|• Удобная работа с товарами и ценами: выгрузите готовые товарные карточки в 1С:Кассу из сервиса 1С:Номенклатура, загрузите товары из файла в любом из форматов (.xls, .ods, .csv) или добавьте позиции вручную
	|
	|• Подключите одну или несколько автономных онлайн-касс. 1С:Касса работает с ККТ Штрих-Мпей-Ф, Атол, Эвотор, а также другими моделями ККТ, получившими сертификат «Совместимо! Система программ 1С:Предприятие»
	|
	|• Данные со всех касс и торговых точек в «одном окне» в режиме реального времени
	|
	|• Работа с заказами клиентов: загрузка и выгрузка готовых заказов, распределение заказов между курьерами, подготовка маршрутных листов для выездных сотрудников. Ведение ведомостей по состоянию заказов клиентов
	|
	|• Поддержка нескольких систем налогообложения на одном кассовом аппарате (например, ОСН и ЕНВД)
	|
	|• Создание аккуратных ценников и этикеток по готовым шаблонам
	|
	|• Легко поддерживать порядок в складских запасах (учет, корректировка остатков)
	|
	|• Учет денежных средств (ДДС)
	|
	|• Полезные отчеты о работе магазина: отчеты по выручке, продажам, среднему чеку, рейтинг товаров (более 20 отчетов). Монитор торговли показывает как сводные отчеты, так и развернутую информацию по продажам в разрезе торговых точек, кассовых аппаратов, различных ставок НДС и пр. Все отчеты можно отправлять по e-mail
	|'"
	);

	
	МассивОписания = Новый Массив;
	МассивОписания.Добавить(Содержимое1);
	
	МассивОписания.Добавить(Символы.ПС);
	
	ОписаниеФорматированнаяСтрока = Новый ФорматированнаяСтрока(МассивОписания, ЗначениеНастроекПовтИсп.ШрифтПриложения());
	
	Элементы.Описание.Заголовок = ОписаниеФорматированнаяСтрока;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);
	ОбщегоНазначения.УстановитьЖирныйШрифтПолей(ЭтотОбъект, "Далее");
	
КонецПроцедуры

#КонецОбласти


