
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает количество элементов справочника
//
Функция КоличествоВидовОплаты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОплаты.Ссылка
		|ИЗ
		|	Справочник.ВидыОплаты КАК ВидыОплаты
		|ГДЕ
		|	НЕ ВидыОплаты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции

#КонецОбласти

#КонецЕсли