
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСобытие(ИдентификаторСобытия, ТекстСообщения = "") Экспорт
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЛог() Тогда
		
		ИмяФайлаЛог = ЗначениеНастроекВызовСервераПовтИсп.ПутьКФайлуЛога();
		
		Текст = Новый ЗаписьТекста(ИмяФайлаЛог, КодировкаТекста.ANSI,, Истина);
		Текст.ЗаписатьСтроку(Строка(ТекущаяДата()) + " : " + Строка(ИдентификаторСобытия) + " : " + Строка(ТекстСообщения));
		Текст.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти