
#Область ПрограммныйИнтерфейс

Функция ПараметрыВводаАкцизнойМарки() Экспорт

	ПараметрыВводаМарки = Новый Структура;
	
	ПараметрыВводаМарки.Вставить("Номенклатура");
	ПараметрыВводаМарки.Вставить("АдресМарокВХранилище");
	ПараметрыВводаМарки.Вставить("ОбъектОповещения");
	ПараметрыВводаМарки.Вставить("ИмяПроцедурыОповещения");
	ПараметрыВводаМарки.Вставить("МаксимальноеКоличество");
	ПараметрыВводаМарки.Вставить("АдресМарокЧекаВХранилище");
	ПараметрыВводаМарки.Вставить("КонтрольДублейМарок", Истина);
	
	Возврат ПараметрыВводаМарки;
	
КонецФункции

Процедура ВвестиАкцизнуюМарку(ПараметрыВводаМарки, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Номенклатура",             ПараметрыВводаМарки.Номенклатура);
	ПараметрыФормы.Вставить("АдресМарокВХранилище",     ПараметрыВводаМарки.АдресМарокВХранилище);
	ПараметрыФормы.Вставить("МаксимальноеКоличество",   ПараметрыВводаМарки.МаксимальноеКоличество);
	ПараметрыФормы.Вставить("АдресМарокЧекаВХранилище", ПараметрыВводаМарки.АдресМарокЧекаВХранилище);
	ПараметрыФормы.Вставить("КонтрольДублейМарок",      ПараметрыВводаМарки.КонтрольДублейМарок);
	
	ОбработчикОповещения = Новый ОписаниеОповещения(ПараметрыВводаМарки.ИмяПроцедурыОповещения, ПараметрыВводаМарки.ОбъектОповещения, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ВводМарок.Форма", ПараметрыФормы, ДополнительныеПараметры.Форма,,,, ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти
