
#Область ПрограммныйИнтерфейс

// Заполняет справочник ВидыОбъектовЕГАИС предопределенными данными.
//
// Параметры: нет.
//
Процедура ОбновитьВидыОбъектовЕГАИС() Экспорт

	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("АлкогольнаяПродукция"      , "http://fsrar.ru/WEGAIS/ProductRef", "pref", "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("Организации"               , "http://fsrar.ru/WEGAIS/ClientRef" , "oref", "");
	
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ДокументыЕГАИС"            , "http://fsrar.ru/WEGAIS/WB_DOC_SINGLE_01", "ns" , "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("АктПодтвержденияТТН"       , "http://fsrar.ru/WEGAIS/ActTTNSingle"    , "wa" , "/opt/in/WayBillAct");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ЗапросАлкогольнойПродукции", "http://fsrar.ru/WEGAIS/QueryParameters" , "qp" , "/opt/in/QueryAP");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ЗапросОрганизаций"         , "http://fsrar.ru/WEGAIS/QueryParameters" , "qp" , "/opt/in/QueryPartner");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ЗапросОстатков"            , ""                                       , ""   , "/opt/in/QueryRests");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("Квитанция"                 , "http://fsrar.ru/WEGAIS/Ticket"          , "tc" , "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ОтветАлкогольнаяПродукция" , "http://fsrar.ru/WEGAIS/ReplyAP"         , "rap", "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ОтветОрганизации"          , "http://fsrar.ru/WEGAIS/ReplyClient"     , "rc" , "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("СправкаБ"                  , "http://fsrar.ru/WEGAIS/TTNInformBReg"   , "wbr", "");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ТТН"                       , "http://fsrar.ru/WEGAIS/TTNSingle"       , "wb" , "/opt/in/WayBill");
	Справочники.ВидыОбъектовЕГАИС.ЗаполнитьПредопределенныйЭлемент("ЧекККМ"                    , "http://fsrar.ru/WEGAIS/Cheque"          , ""   , "/xml");

КонецПроцедуры

Процедура ПриПолученииКвитанцииНаЗапрос(СтруктураВходящегоДокумента, ТТН) Экспорт
	
	ДокументТТН = ТТН.ПолучитьОбъект();
	
	НоваяКвитанция = ДокументТТН.Квитанции.Добавить();
	НоваяКвитанция.КвитанцияТекстXML = Новый ХранилищеЗначения(СтруктураВходящегоДокумента.ТекстXML, Новый СжатиеДанных(9));
	
	ДокументТТН.Записать();
	
КонецПроцедуры

#КонецОбласти